

// 함수 포인터
//  : 함수도 주소가 있다.
//    포인터를 이용해서 함수의 주소를 저장하거나, 호출하는 것이
//    가능하다.
// 함수의 타입
#include <stdio.h>

// 함수 포인터 사용하는 이유?
//  => 함수 포인터 변수에 함수의 주소를 담는다.
//  => 실행 시간에 어떤 함수를 호출할지 결정하고 싶다.
//  => 정책을 런타임에 결정하기 위해서 

// void()
void foo()
{
	printf("foo\n");
}

int main()
{
	// &int     -> int *
	// &int[2]  -> int(*)[2]
	// void()   -> void(*)()
	
	void (*p1)() = &foo;    // 1 - C++
	void (*p2)() = foo;     // 2 - C
	// 함수의 이름은 함수 포인터 타입으로 decay 된다.

	(*p1)();  // 역참조를 통해 호출하는 방법 - 1
	p1();     // 바로 호출하는 방법          - 2

	int n;        // int
	int arr[2];   // int[2]
}










